"""
    Клас - це конструкція мови програмування,
    яка описує певний користувальницький тип даних,
    що включає як самі дані різних типів, так і методи
    (функції), призначені для роботи із цими даними
    -------------------------------------------------------
    Компоненти класів поділяються на статичні та динамічні:
    - статичні - належать самим класам
    - динамічні - екземплярам цих класів (об'єктам)
    --------------------------------------------------------
    Парадигми ООП (об'єктно-орієнтованого програмування):
    ==============
    1. АБСТРАКЦІЯ - класи є абстрацією (узагальненням) певного
        поняттям, яке описує спільні властивості деякої групи об'єктів.
    2. ДЕКОМПОЗИЦІЯ - класи використовуються для розподілу функціоналу
        програми відповідно до призначення цих класів.
    3. ІНКАПСУЛЯЦІЯ.
    4. НАСЛІДУВАННЯ (УСПАДКУВАННЯ).
    5. ПОЛІМОРФІЗМ.
    ---------------------------------------------------------
"""

import pickle
from models.student import Student
from models.group import Group


if __name__ == '__main__':

    # 1
    student1 = Student('Вася Пупкин', 21, 7.5)
    student2 = Student('Катерина Шубкіна', 19, 11.2)
    student3 = Student('Наталія Супкіна', 27, 10)
    # 2
    group = Group('Python Py-24')
    group.add_student(student1)
    group.add_student(student2)
    group.add_student(student3)
    print(group)
    group.display_students()
    # 3
    group.del_student('Катерина Шубкіна')
    group.rate_change('Вася Пупкин', 9.5)
    print(group)
    group.display_students()
    # 4 - Серіалізація об'єкту group у бінарний файл
    with open('group.dat', 'wb') as file:
        pickle.dump(group, file)
    print('\n> Дані були успішно серіалізовані')

    # 5 - Десеріалізація (зчитування даних)
    with open('group.dat', 'rb') as file:
        group = pickle.load(file)
    print('\n> Дані були успішно десеріалізовані')
    print(group)
    group.display_students()
