"""
    Клас - це конструкція мови програмування,
    яка описує певний користувальницький тип даних,
    що включає як самі дані різних типів, так і методи
    (функції), призначені для роботи із цими даними
    -------------------------------------------------------
    Компоненти класів поділяються на статичні та динамічні:
    - статичні - належать самим класам
    - динамічні - екземплярам цих класів (об'єктам)
    --------------------------------------------------------
    Парадигми ООП (об'єктно-орієнтованого програмування):
    ==============
    1. АБСТРАКЦІЯ - класи є абстрацією (узагальненням) певного
        поняттям, яке описує спільні властивості деякої групи об'єктів.
    2. ДЕКОМПОЗИЦІЯ - класи використовуються для розподілу функціоналу
        програми відповідно до призначення цих класів.
    3. ІНКАПСУЛЯЦІЯ.
    4. НАСЛІДУВАННЯ (УСПАДКУВАННЯ).
    5. ПОЛІМОРФІЗМ.
    ---------------------------------------------------------
"""
from models.student import Student


if __name__ == '__main__':
    student1 = Student('Вася Пупкин', 21, 7.5)
    student2 = Student('Катерина Шубкіна', 19, 11.2)
    student3 = Student('Наталія Супкіна', 27, 10)

    students_list = [student1, student2, student3]

    for student in students_list:
        print(student)
