"""
	Декоратори у Python - це спеціальні функції вищого порядку,
	які призначення для розширення функціоналу певної функції
	без зміни її власного коду
	-----------------------------------------------------------
"""


def decor01(some_func):
	def wrapper():          # функція-обгортка
		print('# Дії декоратора ПЕРЕД викликом заданої функції ...')
		some_func()
		print('# Дії декоратора ПІСЛЯ виклику заданої функції ...')
	return wrapper


def decor02(some_func):
	def wrapper():          # функція-обгортка
		print('## Дії декоратора ПЕРЕД викликом заданої функції ...')
		some_func()
		print('## Дії декоратора ПІСЛЯ виклику заданої функції ...')
	return wrapper


@decor01
@decor02
def real_func() -> None:
	print('Довільна фунція виконує якусь свою роботу ...')


if __name__ == '__main__':
	real_func()
