"""
	Рекурсія - це прийом програмування, при якому код функції
	містить виклик самої цієї функції, що призводить до її
	автоматичного зациклювання.
	---------------------------------------------------------
"""


def factorial(n: int) -> int:
	"""
		Рекурсивна функція обчислення факторіалу числа
		==============================================
		n! = 1 * 2 * 3 * ... * n
		------------------
		n! = n * (n - 1)!
		------------------
		5! = 1 * 2 * 3 * 4 * 5
		5! = 5 * (4 * 3 * 2 * 1) = 5 * 4!
	"""

	if n == 1:
		return 1
	else:
		return n * factorial(n - 1)


def power(a: float, n: int) -> float:
	"""
		Рекурсивна функція обчислення ступені числа
		===========================================
		2 ** 5 = 2 * 2 * 2 * 2 * 2
		p(2, 5) = 2 * (2 * 2 * 2 * 2) = 2 * p(2, 4)
		-------------------------
		p(a, n) = a * p(a, n - 1)
		-------------------------
	"""

	if n == 1:
		return a
	else:
		return a * power(a, n - 1)


if __name__ == '__main__':
	# 1
	x = int(input('> Введіть натуральне число: '))
	f = factorial(x)
	print(f'{x}! = {f}')

	# 2
	b = float(input('> Введіть основу степеня (дійсне число): '))
	q = int(input('> Введіть показник степеня (натуральне число): '))
	print(f'{b} ^ {q} = {power(b, q)}')
