#-------------------------------------------------------------------------------
# Name:         date_of_week
# Purpose:      Користувач вводить із клавіатури номер дня тижня.
#               Програма виводить назву цього дня
# Author:       dp_ma
# Created:      20.06.2022
#-------------------------------------------------------------------------------

def main():
    try:
        day = int(input('> Введіть номер дня тижня: '))
        week = ('Понеділок', 'Вівторок', 'Середа', 'Четвер', 'П\'ятниця', 'Субота', 'Неділя')
        if day >= 1 and day <= 7:
            for i in range(len(week)):
                if day == i + 1:
                    print(f'{day}-й день тижня це {week[i]}')
                    break
        else: print('Такого дня тижня не існує')
    except ValueError as err1: print(f'Помилка значення: \n {err1}')
    finally: print('Програму завершено!')

if __name__ == '__main__':
    main()
