#-------------------------------------------------------------------------------
# Name:         time_of_day
# Purpose:      Програма запитує котра година.
#               Користувач вводить час у вигляді цілого числа
#               Програма видає привітання в залежності від часу доби
# Author:       dp_maxim
# Created:      20.06.2022
#-------------------------------------------------------------------------------

def main():
    try:
        h = int(input('> Котра година?: '))
        if 4 <= h < 12: print('Доброго ранку')
        elif 12 <= h < 17: print('Добрий день')
        elif 17 <= h < 24: print('Добрий вечір')
        elif 0 <= h < 4 or h == 24: print('Доброї ночі')
        else: print('Такого часу доби не існує.')
    except ValueError as err1: print(f'Помилка значення: \n {err1}')
    finally: print('Програму завершено!')

if __name__ == '__main__':
    main()
