"""
    Інкапсуляція - один із базових принципів ООП
    Доступ до даних, які зберігаються у обєктах класу,
    має бути закритий або обмежений
    --------------------------------------------------
    Аксесори - це методи, призначені для доступу до закритих атрибутів
    Два типу:
    - для зчитування даних get
    - для запису даних set
"""

from lib import BankAccount


if __name__ == '__main__':
    acc = BankAccount(26001234567234, 'Василь Пупкін', 25615)
    print('\nВласник рахунку: ', acc.get_owner())

    debet = float(input('  Введіть суму переказу: '))
    debet += acc.get_amount()
    acc.set_amount(debet)
    print(acc)

    print('\n*** Finish ***')
