"""
	Домашнє завдання після Уроку 11.
	Задача 2.
	------------------------------------------
	Створіть програму, яка дозволяє ввести одним рядком оцінки п'яти студентів,
	та вибрати серед них оцінки високого, достатнього та середнього рівнів
	-------------------------------------------
"""


def main():
	score = input('> Введіть 5 оцінок по 12-ти більній системі\n  одним рядком через пробіл: ')
	score = list(map(int, score.split()))

	print(f'\nСписок оцінок ВИСОКОГО рівня: {list(filter(lambda x: x <= 4, score))}')
	print(f'\nСписок оцінок ДОСТАТНЬОГО рівня: {list(filter(lambda x: 4 < x <= 8, score))}')
	print(f'\nСписок оцінок СЕРЕДНЬОГО рівня: {list(filter(lambda x: x > 8, score))}')


if __name__ == '__main__':
	main()
