"""
	Домашнє завдання після Уроку 11.
	Задача 2.
	------------------------------------------
	Створіть програму, яка пропонує користувачу ввести одним рядком координати
	однієї точки на площині, а другим рядком - координати другої точки на площині,
	та обчислює відстань між цими точками.
	-------------------------------------------
"""


from math import sqrt


def main():
	x = input('> Введіть координати першої точки  (x1 та y1)\n  одним рядком через пробіл: ')
	x = list(map(float, x.split()))
	y = input('> Введіть координати першої точки  (x2 та y2)\n  одним рядком через пробіл: ')
	y = list(map(float, y.split()))

	distance = lambda a, b: round(sqrt((b[0] - a[0])**2 + (b[1] - a[1])**2), 2)
	print(f'\nX({x[0]}, {x[1]}) {"_"*10} Y({y[0]}, {y[1]})')
	print(f'\nВідстань між точками X та Y становить: {distance(x, y)}')


if __name__ == '__main__':
	main()
