"""
	Домашнє завдання після Уроку 12
	Завдання 2.
	-----------------------------------------------------
	Створіть функцію для обчислення факторіалу числа за допомогою
	генератора списку натуральних чисел від 1 до заданого числа та
	функції reduce
	------------------------------------------------------
"""
import functools


def main():
	n = int(input('> Введіть ціле натуральне число для обчислення його факторіалу: n = '))
	print(f'\nФакторіал числа {n} дорівнює: {n}! = {functools.reduce(lambda x, y: x * y, [i + 1 for i in range(n)])}')


if __name__ == '__main__':
	main()
