"""
	Домашнє завдання після Уроку 12
	Завдання 3.
	-----------------------------------------------------
	Створіть рекурсивну функцію для підрахунку суми цифр заданого
	натурального числа.
	------------------------------------------------------
"""


def sum_num(num: int, suma=0, t=''):
	if num > 0:
		suma += num % 10
		t += str(num % 10) + ' + '
		return sum_num(num//10, suma, t)
	else:
		return [suma, t]


if __name__ == '__main__':
	x = int(input('> Введіть ціле натуральне число: n = '))
	res = sum_num(x)
	print(f'\n Сума цифр числа {x} складає {res[1][:-3][::-1]} = {res[0]}')
