"""
						Словники
				=========================
	Словник (set) - це невпорядкований набір записів, який формується за принципом
	бінарного дерева. Призначені для швидкого пошуку даних, які в ньому зберігаються.
	Кожен запис у словнику складається із пари величин: ключ/значення (key/value)
	Ключі є унікальні. Значення можуть повторюватись

"""


def main() -> None:
	# Створення словника
	elements = {
		'Au': 'Золото',
		'Ag': 'Срібло',
		'Pt': 'Платина',
		'Al': 'Алюміній',
		'Fe': 'Залізо'
	}
	print(elements)
	# Розширення словника
	elements.update({
		'Pb': 'Свинець',
		'Si': 'Кремній',
		'He': 'Гелій'
	})
	print(elements)
	# Цикл перебору
	for key in elements:
		print(f'{key} => {elements[key]}')
	# Пошук за ключем
	sign = input('> Введіть символ хімічного елементу: ')
	if sign not in elements:
		print('Такого елеиенту немає у нашому словнику')
	else:
		print(f'Елемент знайдений: {sign} => {elements[sign]}')


if __name__ == '__main__':
	main()
