#-------------------------------------------------------------------------------
# Name:        rectangle_calc
# Purpose:     Програма обчислення площі прямокутника (лінійний алгоритм)
# Author:      Maxim Davidchuk
# Created:     15.06.2022
#-------------------------------------------------------------------------------

from math import sqrt

def main():

    # 1. Виведення заголовку
    print('\t******************************************')
    print('\t* Програма обчислення площі трикутника *')
    print('\t******************************************')

    # 2. Введення початкових даних
    print('\n> Введіть довжини сторін трикутника:')
    a, b, c = float(input('  a = ')), float(input('  b = ')), float(input('  c = '))

    # 3. Виконання обчислень
    # Формула Герона
    p = (a + b + c) / 2
    s = sqrt(p * (p - a) * (p - b) * (p - c))

    # 4. Виведення результату
    print(f'\n> Площа Вашого трикутника: S = {s} кв. од.')


if __name__ == '__main__':
    main()
