#-------------------------------------------------------------------------------
# Name:        rectangle_calc
# Purpose:     Програма обчислення площі прямокутника (лінійний алгоритм)
# Author:      Maxim Davidchuk
# Created:     15.06.2022
#-------------------------------------------------------------------------------

def main():
    # 1. Виведення заголовку
    print('\t******************************************')
    print('\t* Програма обчислення площі прямокутника *')
    print('\t******************************************')

    # 2. Введення початкових даних
    print('\n> Введіть довжини сторін прямокутника:')
    a, b = float(input('  Довжина: a = ')), float(input('  Ширина:  b = '))

    # 3. Виконання обчислень
    s = round(a * b, 2)

    # 4. Виведення результату
    print(f'\n> Площа Вашого трикутника: S = {s}')


if __name__ == '__main__':
    main()