#-------------------------------------------------------------------------------
# Name:        rectangle_calc
# Purpose:     Програма обчислення опору провідників
# Author:      Maxim Davidchuk
# Created:     15.06.2022
#-------------------------------------------------------------------------------

def main():
    try:
        # 1. Виведення заголовку
        print('\t*****************************************')
        print('\t* Програма обчислення опору провідників *')
        print('\t*****************************************')

        # 2. Введення початкових даних
        print('\n> Введіть опори ділянок (Ом):')
        r1, r2 = float(input('  r1 = ')), float(input('  r2 = '))

        # 3. Валідація (перевірка достовірності) даних
        if r1 == 0 or r2 == 0:
            raise RuntimeError('Опори не можуть бути нульовими!')
        if r1 < 0 or r2 < 0:
            raise RuntimeError('Опори не можуть від\'ємними!')

        # 4. Виконання обчислень
        r = round(r1 * r2 / (r1 + r2), 1)

        # 5. Виведення результату
        print(f'\n> Загальний опір обох ділянок: r = {r} (Ом)\n')

    except ValueError as err1:
        print(f'\n> Помилка введення:\n  {err1}\n')

    except RuntimeError as err2:
        print(f'\n> Помилка значення:\n  {err2}\n')

    finally:
        print('\t*****************************************')
        print('\t*          Програму завершено           *')
        print('\t*****************************************')

if __name__ == '__main__':
    main()